{
  "code": 0,
  "data": {
    "articleList": [
      {
        "id": 387,
        "title": "2018/01/02",
        "mood": "fendou",
        "content": "  <p>新年的第二天了，2017到2018，还是蛮值得好好回忆的，一个月前的日记简单总结过，今天继续补充：</p><p><font size=\"3\">1、工作</font></p><p>基本还是继续保持着稳定前进的状态，岗位升了一个级别，从外勤助手环卫版的产品迭代开始，负责前端C区小分队的工作协调，目前没有遇到太多困难。</p><p>新年新目标 <i>-- 时刻关注行业招聘动态，上半年顺利跳槽。继续学习团队管理合作的方法论。工作满两年后着手准备软件设计师认证</i></p><p><font size=\"3\">2、前端技术学习</font></p><p>上半年大多时间还是针对react下功夫，系统学习react、版本开发中反复实践，对基本的概念和react的优缺点都已经有了较为明确的认识；下半年接触腾讯课堂，几个月下来跟着几位前端技术大咖学习，对web前端的认识有了不同的看法，web前端相对其他技术方向最明显的特点就是---技术更新迭代速度非常快，近年来js、css框架层出不穷，但优胜劣汰的自然法则也决定了百花争鸣后，只有少数人活到最后。从11月份开始，工作任务完成后的时间安排有了改变，搁浅react源码的学习，从头开始巩固js、css基础知识，腾讯课堂的培训课、业内知名博主的博客、论坛、经典学习书等等，技术学习的路上必须集百家所长。</p><p>新年新目标 -- <i>事无巨细的js、css基础知识继续扎实学习；总结常见js面试题，利用碎片化时间进行反复自检</i></p><p><font size=\"3\">3、专业学科之外的充电学习</font></p><p>17年了25本书，不算多，但涉猎范围还是比较广泛的，方法论、文学小说、个人传记、企业传记、人生感悟等等都覆盖到了。其中《刻意练习》、《零秒思考》从思维引导层面给我带来很大帮助，想到一直对个人研发能力持保守态度，看到书中各种案例的讲解才发现其实是在学习方法上存在很多误区，没有形成正反馈，进而影响了学习心态和学习效率；《没有行李的旅行》是在去香港的飞机上看完的，让我对看待世界的角度也有了新变化，人生的终极意义在于追求幸福，物质生活上，要在自己最能追梦、最能承受选择失败的年纪做自己内心想做的事情，前提是在追逐的过程一定要让内心的精神世界更加富足，更加成熟。</p><p>新年新目标 -- <i>读30本书，不刻意追求速度，<span style=\"line-height: 1;\">多思考总结，</span>做好读书笔记。准备toeic， 目标750分以上</i></p><p><font size=\"3\">4、锻炼身体</font></span></p><p>将近一月左右没游泳了，恰好赶上游泳馆装修，卡也到期了，这一年在游泳耐力上进步还是较大的，三组800m蛙泳+200m自由泳的锻炼强度已经完全能适应了，明年考虑在速度上有所突破。</p><p>下班后的负重训练一直保持的不错，入冬以来将3-4组的强度逐渐减到2-3组，室内温度不高，低温训练效果有限，保持体形即可。</p><p><br></p><p>28周岁了，感叹岁月流逝的如此之快，更要珍惜时间，相信自己，无畏向前，加油！</p>"
      },
      {
        "id": 387,
        "title": "2018/01/24",
        "mood": "fendou",
        "content": "<p>三周没有写日记了，2018年的开始，生活中已经发生了太多事情。这几天终于放松了一下，好好梳理一下，也为接下来的生活做个安排。</p><p>终于决定要把长久以来的胃病治疗好，去积水潭做了胃镜，<span style=\"line-height: 1;\">苍了个天，管子从嘴伸进胃里，在管子里搅动，眼看着胃酸从管子里翻上来，真TM的是我活这么多年最难受的体验了</span><img src=\"http://img.t.sinajs.cn/t4/appstyle/expression/ext/normal/b6/sb_thumb.gif\" style=\"line-height: 1;\">。</p><p>检查结果果然是十二指肠溃疡，幽门螺杆菌感染也比较严重，医生给开了四种杀菌消炎的药，加上专门治疗溃疡的药。拿了三次药，前前后后花费2000RMB<img src=\"http://img.t.sinajs.cn/t4/appstyle/expression/ext/normal/0b/wabi_thumb.gif\" style=\"line-height: 1;\">，下周还要做复查。。。</p><p>治疗胃病期间，还TMD赶上了流感，发烧到接近39度，连续输液三天，上次输液都不记得是多少年前了。。。</p><p>唉，这么多年一直把保持身体健康挂在嘴边，还是没能严格自律的做到，之后坚决要保持健康的生活方式，杜绝辛辣食物，尽可能养成科学的作息规律，投资身体健康一直到老。</p><p><br></p><p>工作方面，本来每天可以坚持学习的，这期间被感冒和胃病搞得也没精力每天学习Web前端的相关内容。买了2月10号的回家票，<span style=\"line-height: 1;\">恰好最近外勤的开发任务跟郭霄联调基本结束，</span>还有两周左右的时间，继续奋斗。</p><p><br></p><p>元旦期间，去姑姑家小聚，二姑父给定了三个2018年的目标：</p><p>1、关注京津冀地区的房价和政策，重点关注交通方便的地区</p><p>2、关注烟台房价，烟台未来的发展潜力还是非常值得期待的，18年从北京到烟台的高铁开通，估计是个机会，买房出手速度要快。</p><p>3、关注烟台工作机会，之前提到过航天研究所，这个校招期间就研究过，web前端岗位没有招聘，估计可能性不大。</p><p><br></p><p>接着上一篇给自己定的目标，再加一条吧：18年在烟台买个小户型房子！<img src=\"http://img.t.sinajs.cn/t4/appstyle/expression/ext/normal/40/cool_thumb.gif\" style=\"line-height: 1;\"></p><p><br></p>"
      },
      {
        "id": 388,
        "title": "2018/02/12",
        "mood": "keai",
        "content": "<p>回到家三天了，晚饭闲着无聊，许久没有打开日记，动动笔吧。</p><p>从腊月二十五开始请了年假，2018年春节假期，早晨乘地铁去北京南站，跟往常的春运期一样，地铁上大多是带着行李去火车站的外地人，春节前后<span style=\"line-height: 1;\">的北京，</span><span style=\"line-height: 1;\">不再是人潮拥挤的堵城，</span><span style=\"line-height: 1;\">没有车水马龙的喧嚣，略显冷清，但即便如此</span>留在北京过年的朋友也有上千万人。。。</p><p>如此看来，也不难想象的到日常的北京是怎样的面貌，为什么那么多人总说一线城市打拼会没有归属感，工作压力大？没户口没房没车？如果这样，那为什么每天又有那么多压力大，没户口没房没车的年轻人在创造着属于自己的英雄事迹。</p><p>不同的城市之间的确存在客观上的优缺点，但我们都是主动选择去留，而非被动的捆绑。<span style=\"line-height: 1;\">所以，人活的幸不幸福，首先得想明白自己想要什么样的生活。</span></p><p>-----------------------------------------抒情到此结束------------------------------------</p><p>今年跟妈妈商量了一下，决定在城里过除夕夜，一家人团圆的日子，期待<img src=\"http://img.t.sinajs.cn/t4/appstyle/expression/ext/normal/58/mb_thumb.gif\" style=\"line-height: 1;\">。</p><p>未来几天安排：</p><p>腊月二十八：</p><p>&nbsp; &nbsp; &nbsp; &nbsp; 回老家贴春联，见一下亲朋好友，二伯和舅舅年龄大了，长辈们从小很关心照顾我，一年回家一次，无论如何好好唠唠家常。发小们也都忙碌在自己的生活轨迹上，基本也是一年聚一次。今年在城里过年，回老家不知能见到几个，岁月流逝远去，但儿时快乐天真的回忆常常在孤独的时刻涌现在眼前。<br></p><p>腊月二十九：</p><p>&nbsp; &nbsp; &nbsp; &nbsp; 平度 四中 ”大龄儿童“ 小分队 聚餐。<span style=\"line-height: 1;\">这次小聚的主题也很明显了</span><img src=\"http://img.t.sinajs.cn/t4/appstyle/expression/ext/normal/6a/laugh.gif\" style=\"line-height: 1;\">，老段17年11月份第一个结婚，定居烟台，小日子过的很舒服。高中时代的好伙伴聚到一起，永远有聊不完的话题，三年战友寒窗，一起经历了单纯又难忘的青春时光。</p><p>腊月三十：</p><p>&nbsp; &nbsp; &nbsp; &nbsp; 下午是一年一度的上坟习俗，有血缘关系的家庭男性聚到一起，带上酒水、纸钱、鞭炮去给先人们施礼，告慰他们的在天之灵。今年上坟结束后得赶回城里过除夕夜，灯火通明，一家人吃着年夜饭，看春晚，难忘今宵。<br></p><p>初一至初六：</p><p>&nbsp; &nbsp; &nbsp; &nbsp; 走亲访友，自从长大后，这几天都很充实，正月里跟亲朋好友吃吃喝喝本是温馨开心的时光，但随着移动互联网的全面渗透，人与人之间的情感交流逐渐变得越来越淡，科技是把双刃剑，但显然，就在几年之后，人工智能会对人们的日常生活方式进行更加彻底的颠覆。未来已来，但不知人们是否做好充分的准备去迎接。</p><p><br></p><p>初七回京正式上班了，新的一年，生活和工作中面对的任务更加艰巨，鼓足干劲儿，全力以赴 !</p><p><br></p>"
      },
      {
        "id": 389,
        "title": "2018/06/29",
        "mood": "weixiao",
        "content": "<p>好久没有打开日记本，2018年初？2017年末？<span style=\"line-height: 1;\">懒得回翻去看，不过</span>可以确定的是时间已经过去了很久，时光标尺往前移动了很珍贵的一段距离，也可能是28年以来最为难忘的一段人生，以焦虑、痛苦为主线的生活，不想再去打开回忆去想发生的事情，纠结过、伤过了、痛过了、哭过了。。。</p><p>---</p><p>此时听到FM97.4的《男左女右》，主播韩力问主播陈默：</p><p>“2018年过去一半，前半年你有没有觉得疲惫的事情？”</p><p>“疲惫的时候自然是有的，但在累的时候还是转身能够回到生活的原点，关键是在疲惫之后是否有一个疗愈的港湾。”</p><p>----</p><p>我身心疗愈的港湾在哪里呢？这么多年以来，也许是自己是将苦难放大了，也许是自己仍然不够强大到独自承受一切！</p><p>2018下半年的生活即将拉开帷幕，<span style=\"line-height: 1;\">是时候打开内心了。</span>新的职场阶段，鼓足干劲儿、砥砺前行；新的朋友圈子，真诚待人，不卑不亢；听从内心的感情世界，不凑合不将就！</p><p><br></p>"
      },
      {
        "id": 390,
        "title": "2018/12/30",
        "mood": "fendou",
        "content": "<p>2018年12月30日，酒仙桥北路早高峰的拥挤终于在元旦假期才暂时消停下来。在IT产业园区下车后才刚刚九点钟，特地赶了个大早，来这里半年，记忆中每天上班下班都像是在打仗一样，都没有好好在园区内轻松地转几圈。但空荡荡的IT产业园反而让人心里更添了一份冷清。。。</p><p>    58房产事业群按往年惯例一样，将元旦假期往后顺延了两天，还要再加班两天<img src=\"http://img.baidu.com/hi/jx2/j_0065.gif\"/>。封闭会议室果不其然还没开灯，将2018Q4的绩效表发给领导，打开VSCode却没有coding的状态，还是先总结一下自己的2018年吧！</p><p><strong><span style=\"font-size: 18px;\">工作事业</span></strong></p><p>    7月份换了工作，离开了中国电信，加入58房产事业群，担任高级前端开发工程师，半年的工作下来，目前工作算是得心应手，交付的项目也能感到领导和同事对自己的信任。前端技术栈算是比较全面了，偏后端技能栈需要加强，另外的不足就是时间利用率比较低，尤其表现在前后端配合开发阶段，大多数工程师的通病，还是要调节和思考新的方法去适应。</p><p>    接下来的技术目标：</p><ul class=\" list-paddingleft-2\" style=\"list-style-type: disc;\"><li><p>            PWA技术落地58房产开放平台；</p></li><li><p>            承接frs-cli项目，加强node学习，开发自己的前端脚手架工具；</p></li><li><p>            加强内功基础修炼，争取每天刷1~2道leecode，深入ES6+的学习，尝试探索React和Vue源码实现；</p></li></ul><p>    以上目标要在19年4月份之前达成，趁着学习能力没有下滑太严重，去成长速度更快的一线互联网公司发展，再给自己薪资提升一个level。</p><p><span style=\"font-size: 18px;\"><strong>生活状态</strong></span></p><p>    在当下这个快节奏的时代，大多数年轻人工作和生活很难兼顾的很好，自己也不例外。</p><p>    过去的一年最值得高兴的是年初坚持将胃病治好了，目前还没再犯过，3000软妹币也是值了！上半年受工作压力影响，一度出现了焦虑症，失眠频繁出现，还好在中药保健和身体锻炼的配合下挺了过来。另外上周去医院查了慢性咽炎，正在吃药治疗，不过跟胃病不太一样，咽炎治疗一定是很长的拉锯战，还要时刻保证饮食健康，总之，未来身体健康永远放在第一优先级。</p><p>    另外专业外的充电学习不算达标，买了托业英语考试的练习册，坚持了不到一个月停下了，英语学习计划虽然一直没有断下，但自己就是需要有点证明才能心里踏实（傲娇），明年得报名去参加一次托业考试。</p><p>    读书计划上半年基本没怎么执行，下半年主要是看世纪三部曲，看进度应该可以在春节假期前完成，目前需要将读书计划中的总结和笔记重视起来，只刷书不思考的看书方式纯属浪费时间。</p><p>    加入58后弹性工作模式一般晚上下班比较晚，自己制定的身体锻炼计划是两天/次。常规的卧室内健身，俯卧撑、腹肌轮、深蹲。执行效果不错，基本没有断下。小区附近刚开了健身会所，本打算将心肺耐力训练提上日程，但都是一年为周期，暂时还是先不买单，明年工作情况明了再定。</p><p><span style=\"font-size: 18px;\"><strong>个人感受</strong></span></p><p>    2018年真是让人唏嘘不已的一年，不知是不是时光轮回的魔咒，逢8必衰的现象仍然在上演，98年的大水灾，08年的经济危机，18年又是经济危机。98年自己还是个小屁孩儿，08年高中除了应付考试之外，对其他的漠不关心，但现在自己已经工作了两年多，再过两年也要迎接而立之年，对很多事情也有了自己的见解，此刻不得不感叹这一年对整个世界来说都是很惨淡的一年。</p><p>    大国之间的贸易战让资本市场血流成河，P2P金融的泡沫破裂，跑路的公司让多少投机者竹篮打水一场空；互联网创业公司拉不到投资，该倒闭的倒闭，该裁员的裁员；互联网巨头营收大多未及预期，各自的拳头产品发展前景也尚未可知。<br/></p><p>    文化领域的几位巨子先后离开我们的世界，文学泰斗金庸、漫威之父斯坦▪李，这些让引领了几个时代的前辈都在今年陨落了，作为武侠迷和科幻电影迷也在情感上难以接受。其实自己的生命中也有人跟我天人两隔，一位很亲近的长辈也在今年去世了。不过昨天在微信读书上看到一位讲书人对生命的看法，深入我心：</p><blockquote><p><em>死亡不是永别，遗忘才是。</em><br/></p></blockquote><p>    一直以来我们都习惯了“重要的人”的陪伴，一旦陪伴不再，我们长久的惯性会被打破。但悲伤难过之后换一个角度来看，其实那些离开我们的人虽然不会再回来，但曾经与我们共同度过的时光却早已印在我们的记忆中，在某个时刻突然想起甚至对我们能给我们更加深刻的“情感抚慰”。</p><p>    好久没动笔写字，不知不觉都11点了，就写到这里，面对即将到来的2019年，戒骄戒躁，相信时间的力量，保持积极心态勇敢走下去！</p>"
      }
    ]
  }
}