{
    "articleList": [{
            "id": 391,
            "title": "2019/02/06",
            "mood": "fendou",
            "content": "<p>大年初二的早晨，农历新年最忙的几天过完了，整个人飘飘的，迈入工作阶段后，每年的春节前后的两三天都是对身心精力的考验，家乡有放鞭炮的习惯，从晚上几乎不间断持续到第二天早晨，所以睡眠成了很奢侈的事情<imgsrc=\"http://img.baidu.com/hi/jx2/j_0065.gif\"/>，从昨天下午补觉，今早睡到10点，现在脑子才刚刚清醒过来，回家10天了，后天又一次要踏上回京的路，不舍之情已经隐隐出现，大过年的不伤感了，简单随笔回顾一下吧。</p><p><br/></p><p><strong>技术学习：</strong></p><p><strong><br/></strong></p><p>首先，下个结论吧，春节期间在家要学习沉淀点新知识是很困难的。没错，这次的学习计划又没完成，Node.js还是得回去上班后从项目中学习，看着教程从头敲一遍没有任何意义。技术学习上只是跟着《极客时间》的教程重新巩固了基础知识，这两天还是争取将SEO专题的基础系统学一遍。<imgsrc=\"http://img.baidu.com/hi/jx2/j_0041.gif\"/>赶鸭子上架的感觉</p><p><br/></p><p><strong>娱乐放松：</strong></p><p><br/></p><p>假期模式的独有板块，完成度很满意<imgsrc=\"http://img.baidu.com/hi/jx2/j_0058.gif\"/>，刷完了《越狱》，相当高的强度，年前几天从白天刷到凌晨，迈克尔▪斯科菲尔德的做事方式还是能延伸出很多底层核心能力，做事情的目标和决心，计划的缜密性，对人性的把握让他无往而不利，人生匆匆几十年学的不就是这些嘛。</p><p><br/></p><p>昨晚跟干兄弟去电影院看了《流浪地球》，之前很担心会毁掉大刘的原著，结果发现是超出预期的好电影，朋友圈和各大论坛都刷屏了，连国外的电影大亨都纷纷点赞，让人更加期待《三体》的上映。未来世界的想象是无限的<imgsrc=\"http://img.baidu.com/hi/jx2/j_0063.gif\"/></p><p><br/></p><p><strong>读书充电：</strong></p><p><br/></p><p>看了一本《无现金时代》，也是科普性质的书，内容相对书名有点“简陋”。</p><p><br/></p><p><strong>运动健身：</strong></p><p><br/></p><p>无，shame！<imgsrc=\"http://img.baidu.com/hi/jx2/j_0062.gif\"/></p><p><br/></p><p>计划就不写了，元旦假期已经完成，没有变化，猪年加油干！</p><p><br/></p><p><br/></p>"
        },
        {
            "id": 392,
            "title": "2019/05/20",
            "mood": "fendou",
            "content": "<p>时隔5个月，再次打开尘封已久的日记本，在一年一度的“520”，不过跟节日没啥关系，这次之所以要动笔，是自己的工作事业即将迈向更高的台阶，正好也对自己过去近半年的生活做一下总结。</p><h2>一、匆匆的300天</h2><p>互联网行业是与时间赛跑的世界，去年的7月10号入职，到今年5月16号，在58集团的工作还不满一年，就选择跳槽到新公司，这在长期浸泡在传统行业的人看来简直就是对工作的不尊重，是一种个人工作不踏实的表现，而在互联网的世界，在一家公司待不到一年后就离职的现象平平无奇，在58内部的IM客户端里几乎每天都能看到 “XXX加入了群聊”，“XXX退出了群聊”，去年9月份入职到前端技术部的妹子更是待了不到三个月就离职了，“铁打的营盘，流水的兵”，用来形容互联网行业简直再恰当不过。</p><p>这300多天，在58房产事业群的前端技术部的成长和收获是非常大的。还记得刚入职第一天，上午培训，下午就接到需求参与开发工作，现在想来，正是这个契机让我对接下来的每一期产品需求都做好了计划，认真对待:</p><blockquote><p>新的业务需求可能随时砸到自己头上，时间珍贵而有限是永恒的真理，敬畏技术，首先在做事态度上做到120%的重视</p></blockquote><p>技术成长背后的项目：</p><p>1、入职第一天就开始投入业务开发，首次参与移动端项目，首次使用vue技术栈，调研并产出基于VW的移动端适配方案。整个项目周期跟组内的妹子小白配合很好，几乎没遇到任何技术和需求上的困难。也在这一阶段结交了几位后端开发工程师，而且算是为数不多的能私下聊天的朋友。</p><p>2、接到组长任务做PWA技术方案的研究，这算是在58工作期间最大的收获了，完整的学习了PWA技术体系的相关内容，即便目前在中国的互联网产品中还没有大规模使用，但整个技术生态的发展还是很有前景的。从理论到实践的过程中也总结了两篇文章，发表在部门的微信公众号上。唯一有些遗憾的是没能在离职前在实际项目中落地。</p><p>3、春节运营活动，参与人数最多，周期最长的项目，出动了4个前端开发，封闭了2个多月，业务开发难度虽然不大，但确实我首次参与业务实时性这么强的项目，期间无数次的需求的梳理，变更，跨部门沟通协调，一度搞得RD、运营、UI设计情绪失控，年后兑奖第一天居然在兑奖时间点无法按时兑奖，后端开发的W解决bug的过程，部门经理、技术总监全来了封闭会议室，花了十几分钟将bug修复，W额头脸上全是汗。上线10天1000多万的UV，算是一份合格的答卷。</p><p>4、58 PC站和APP端的个人中心拆分迁移。这应该可以算是我参与过的最头疼的项目了，封闭了一个多月，看着velocity模板和写成混沌状态的jquey代码，时刻告诉自己，人生是一场修行，技术积累是几乎不存在的，不过磨练心性到也算是一种收获。</p><p>其他一些边边角角的工作就不总结了，参与的工作成绩如果按满分100分算的话，我是有信心给自己至少打90分的。</p><p>当然，离职前的一个月很大精力放在了找新工作的面试上，成果也不错，美团点评-用户平台、百度-大搜索-前端技术部、字节跳动-核心广告投放，还有至今没有通知的蚂蚁金服-微贷事业部（够傲娇，快半个月了，不给通过的话倒是给个邮件啊）。能收到这些公司的认可也对的起自己的努力了。</p><p>目前已经决定加入字节跳动，进入最核心的广告投放系统，一眼望去满满的挑战！期待！</p><h2>二、看不到太远的未来，那就做好现在</h2><p>想了半天如何给这部分起标题，还是从时间维度出发吧，虽然是一个鸡汤味浓浓的标题，但现在对这句话的所思所想与一年前相比却有了更加深刻的认识。</p><p>能确定的是，在未来的至少1-2年内我都会在互联网行业做技术开发工作，大概率不会局限在前端领域，一定是机遇和挑战并存。所以，如何在核心竞争力上更上一层楼，要做到哪些事情是现在要开始思考的。</p><p>下面内容部分摘自一位前端前辈的<a href=\"https://zhuanlan.zhihu.com/p/66364708?utm_source=wechat_session&amp;utm_medium=social&amp;utm_oi=557998090557251584\">知乎专栏</a></p><h4>1、技术成长的大致过程</h4><p><em>初期技术热情极大 --&gt; 大量标志性技术项目 --&gt; 转向综合性思考 --&gt; 带团队/关注方法论</em></p><p>技术的发展需要商业推动，没有使用场景的国家是很难推动技术进步的，科学除外。</p><p>所以业务技术是具备可持续发展的路线，毕竟大家都要吃饭，有业务价值的项目会活下来，附着在业务上的技术才能活下来，才有可能开枝散叶。</p><h4>2、技术不是科学，普通人下功夫可以学会</h4><p>学习技术不需要很聪明的头脑，只要肯下功夫，拥有不错的理解能力，任何人都可以把技术细节搞清楚。</p><p>任何年龄段学习技术细节都很容易，在你需要深入细节的时候再深入进去，不需要深入的时候把时间花在==了解宏观架构==上，==培养高效的学习能力==，能准确判断某个技术细节是否有必要掌握，如需要该如何快速掌握核心内容，并在掌握之后不留恋，可以快速抽身出来继续全局性思考。这种思维是有门槛的。</p><h4>3、搞清楚业务对技术的真实诉求</h4><p>业务思维是解决问题，技术思维是创造问题。</p><p>拥有技术思维的人，容易沉迷于解决不切实际的问题，或者是别人解决过的问题。这种思维对技术学习是非常有帮助的，但如果长期不能转变这种思维，对公司来说是无法创造什么价值的。</p><p>拥有业务思维的人，首先要懂业务，只有懂业务，跟着对的业务，才能对未来又信心，知道自己的付出可以换来回报。</p><p>现在互联网市场竞争很激烈，低技术门槛的蓝海基本已都变成了红海，我们更多需要决策的是未来几年内业务的收益是否值得现在投入的研发资源。</p><p>未来1-2年的成长路线就向这几个方面靠拢吧，是时候尝试沿着一个业务方向深度耕耘了。</p><h2>三、生活永远大于工作</h2><p>自从成年以后，过去十几年让我清楚认识到自己是一个对生活质量有一定要求的人，这也是为什么在各种社交媒体上，我的签名始终是“一个奋斗型的享乐主义者”。我对自己的身体健康和衣食住行比起同龄的大多数人都要重视，这么多年过去了，我发现这是一种真正意义上的天赋。</p><p>所以，我在大三下半年花费暑假的大量时间参与全国竞赛，仍然能在输掉起跑线的情况下赢在终点--顺利考上中国传媒大学的研究生。而其中最重要的是我在作息上做了极为严格的计划，雷打不动的执行，生活质量得到了很大的保障，那几个月的学习效率应该算是我人生的巅峰了吧。</p><p>所以，我在毕业后可以选择付出三分之一以上的工资住在公司旁边，只为生活上方便和更多的时间放在快速成长上，而同时加入电信的很多同事都把时间花在路上，他们很多现在仍然在电信工作，拿着月薪一万块钱左右的工资。</p><p>所以，我在拿到北京户口后，从电信跳槽到58集团仍然住在离公司通勤15分钟的小区，有些同事仍然为了省几百块钱住在通勤时间1个小时以上的位置。加入字节跳动后，我的工资已经接近他们的两倍。</p><p>看似是工资提升给自己带来了物质上的变化，其实回到问题的原点上，首先是我让自己的生活质量变得更好，才能有动力和条件去更加高效率的成长。这是过去十几年给我带来的最重要的一课，未来也将继续坚持执行下去。</p>"

        },
        {
            "id": 392,
            "title": "2019/06/29",
            "mood": "fendou",
            "content": "<p>2019年6月29日，今天是我的29岁生日，研究生毕业整三年，目前经历着毕业后的第三份工作。人们常说男人的30岁是一个坎，家庭和事业两个人生最重要的主题，在当前社会的主流的思想仍然是：大学毕业后到30岁，短短几年的时间就要把这人生的两大主题解决好。</p><p>我也从来不会认为这种看法是错的，但在这个浮躁的时代，尤其是拼搏在一线城市的年轻人，绝大多数人在这几年间面对的压力要比父母那代人大的多，一方面是社会竞争压力的确大了很多，但更重要的是，物质极大丰富的时代，大家对投入回报比的概念渐渐变淡了，很多人失去了对未来生活的危机感。</p><p>粗浅的写了这些想法，只是个人对当下大多数同龄人生活缩影的直观感受。从今天开始，迈进了人生的第30个年头，老规矩，重要的时间节点，总结过去，展望未来。</p><p>刚刚提到的两大人生主题，我也是一个都没有解决。各方面条件不够成熟，没有谈恋爱，结婚生子更是遥遥无期。相对来说，事业上算是迈上了新台阶，五月份换了新工作，跳槽到字节跳动广告系统，工作三年是事业上一个重要节点，很幸运加入到了一个氛围开放，工作效率很高的团队，而且收入相对刚毕业时涨了4倍。</p><p>事业也谈不上多么出色，但至少追上了北京同行业同龄人的平均水平，心态上也不再像刚毕业时那么焦虑。</p><p>况且当年选择拿到北京户口简直是最正确的决定了，工资收入取决于自己努力，而政策层面上的规定却是个人能力所无法改变的。上周26号，北京小汽车摇号，幸运之神降临了，普通指标车牌号第12次摇号中签了！仅仅两年的时间，已经算是中彩票的运气了。在朋友圈发了转租信息后，58同城的前领导夸了一句：你这两年的职业规划挺硬，北京户口，北京车牌，大厂背景，高薪全整上了，再整个北京媳妇呗。虽然是一句玩笑话，但也让我肯定了自己这几年努力的大方向是对的，也让我面对未来更大的挑战跟不确定充满了信心。</p><p>在2020年（30岁）到来之前还有整整半年，再给自己做个完整计划！</p><h3>工作：</h3><p>百分百投入项目开发，继续加上解决问题，做一些基础通用服务的产出；加强学习互联网广告相关业务，广告专业知识补课；技术上加强学习node，typescript，Linux; 养成算法训练的习惯,每周至少四道题。</p><p>个人自我挑战目标：最近在看德国工程师Robin的《The road to learn React》。很欣赏作者能持续不断的输出技术内容，也由衷钦佩作者的开源精神。所以下半年打算自己尝试写一本技术书，写一本深入浅出的React教程。目前准备工作已经做好，预计3个月左右完成初稿，然后就联系出版社编辑，争取可以在年前出版，不考虑过多的功利和商业意图，纯粹就是为了挑战自己。</p><h3>兴趣爱好：</h3><p>每周定时运动，锻炼身体算是坚持了挺久的爱好，现在公司有免费的健身房，以部门的工作时间来看，应该也就是每周三和周六去游游泳，剩下时间还是老规矩，晚上回家三组力量训练。身体锻炼上的投入已经看出了受益，没有在毕业三年后变成油腻的中年大叔。</p><p>关于下半年的课外读书计划，时间估计会受到写技术书的影响，适当减少，不过相对阅读，写作是更加锻炼输出能力的，而且也会阅读和参考大量的技术资料，不算对读书时间的挤压。</p><p>自己在生活中从来不太关心仪式感，但在29岁生日，我给自己同时换了新手机和新电脑，一是肯定和犒劳自己过去一段时间付出的努力，二是让自己鼓足干劲儿，信心满满地走向明天。</p>"
        },
        {
            "id": 393,
            "title": "2019/09/28",
            "mood": "ku",
            "content": "<p>2019年十一假期即将来临，工作之后更加深深的体会到，十一假期绝对是一年当中最自由的时间，下一次长假就是新的一年了，目前的工作状态和每天的时间分配再也不可能像13-14年一样笔耕不辍，十一假期一直就是承上启下的节点，对自己来说，也是进行深度思考的时间段，还是得动笔写一下日记。</p><p>5月22日加入字节跳动 Data广告系统，新的工作挑战很多，环境的适应性，产品迭代速度快，技术栈激进。。。 4个月的时间的磨合，目前算是能将手头工作处理的得心应手。</p><p>下个双月就会进行试用期答辩，产出成果也要提前开始整理，自己是最晚一个加入当前项目组的，业务上暂时没有太多选择，暂时只接触到一个项目。云图的业务难度超出之前接触过的所有项目，付出了很多精力去梳理产品流程、设计代码，希望能带来相应的回报。另外，如何利用技术更多的“创造收益”是接下来必来要思考的，目前只有云图node服务在重构，可以考虑适当参与。</p><p>目前云图的产品架子已经搭好，之后就不会像之前那么忙了，下半年需要花更多的时间放在个人成长上,对未来发展最有收益的的几个想法：</p><ol><li>在业务开发之外，学习一门新的编程语言，考虑从Python入手，node从项目实践中去学习。懂后端的前端工程师未来会有很广的选择权。</li><li>私下时间试着学习PMP相关的知识，明年上半年尽可能把证考出来，往项目管理转型也是需要提前准备的一个方向。</li><li>目前阅读计划一如既往的进行，但有所放缓，深感时间的宝贵，底线是保证周末至少2小时阅读</li><li>身体锻炼一直没有放下，每周三游泳，每隔一天健身，身体状态保持的不错</li></ol>"
        }
    ]
}